# 블럭 주머니를 만들자! 주어진 블럭의 상대 좌표들(delta_coordinate)을 담고
# 200 * 200을 순회하며 주머니 안에 있는 애들을 꺼내 합을 저장한다. 하나하나 하다보면 가능하지 않을까?
# 대칭과 구분이 안되는 애들이 많아 생각보다 가짓수가 많진 않다.

blocks = [((0, 0), (0, 1), (0, 2), (0, 3)),     # I블럭
          ((0, 0), (1, 0), (2, 0), (3, 0)),
          ((0, 0), (1, 0), (0, 1), (1, 1)),     # O블럭
          ((0, 0), (1, 0), (2, 0), (2, 1)),     # L블럭
          ((0, 0), (1, 0), (0, 1), (0, 2)),
          ((0, 0), (0, 1), (1, 1), (2, 1)),
          ((0, 2), (1, 0), (1, 1), (1, 2)),
          ((0, 1), (1, 1), (2, 0), (2, 1)),     # L블럭 뒤집기
          ((0, 0), (1, 0), (1, 1), (1, 2)),
          ((0, 0), (0, 1), (1, 0), (2, 0)),
          ((0, 0), (0, 1), (0, 2), (1, 2)),
          ((0, 0), (1, 0), (1, 1), (2, 1)),     # Z블럭
          ((0, 1), (1, 0), (1, 1), (0, 2)),
          ((0, 1), (1, 0), (1, 1), (2, 0)),     # Z블럭 뒤집기
          ((0, 0), (0, 1), (1, 1), (1, 2)),
          ((0, 0), (1, 0), (1, 1), (2, 0)),     # T블럭
          ((0, 0), (0, 1), (0, 2), (1, 1)),
          ((0, 1), (1, 0), (1, 1), (2, 1)),
          ((0, 1), (1, 0), (1, 1), (1, 2))]

# 실행부
N, M = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(N)]
answer = 0

for row in range(N):
    for col in range(M):
        for i in range(19):
            temp = 0
            for j in range(4):
                nr, nc = row + blocks[i][j][0], col + blocks[i][j][1]
                
                # 벗어나면 해당 deltas는 현재 위치에서 사용할 수 없음.
                if nr < 0 or nr >= N or nc < 0 or nc >= M:
                    break
                
                temp += arr[nr][nc]
            
            else:
                # 정상적으로 순회를 마쳤다면 정답 업데이트.
                if answer < temp:
                    answer = temp
print(answer)